      * ACMN.cpybk
      *---------- COPYBOOK FOR CALLING TRFACMN - 07/06/04 ----------*
       01 WK-ACMN.
           05 WK-ACMN-INPUT.
           10 WK-ACMN-BANKCD    PIC X(02).
           10 WK-ACMN-CUYCD     PIC X(03).
           10 WK-ACMN-ACCNO     PIC X(11).
           10 WK-ACMN-BANKID    PIC X(11).
           05 WK-ACMN-OUTPUT.
           10 WK-ACMN-ERROR-FOUND PIC X(01).
           10 WK-ACMN-MANIND    PIC X(01).
           10 WK-ACMN-SWFTID    PIC X(11).
