      *----------  COPYBOOK FOR CALLING TRFACNT - 15/06/04  ----------*
       01  WK-ACNT.
           05  WK-ACNT-INPUT.
           10  WK-ACNT-CCTY           PIC X(02).
           05  WK-ACNT-OUTPUT.
           10  WK-ACNT-ERROR-FOUND    PIC X(01).
           10  WK-ACNT-INDIC          PIC X(01).
