*----------  COPYBOOK FOR CALLING TRFACRO - 07/06/2004  ----------*

       01  WK-ACRO.
           05  WK-ACRO-INPUT.
               10  WK-ACRO-ACCNO        PIC X(11).
               10  WK-ACRO-CUYCD        PIC X(03).
           05  WK-ACRO-OUTPUT.
               10  WK-ACRO-ERROR-FOUND  PIC X(01).
               10  WK-ACRO-RACIND       PIC X(01).
               10  WK-ACRO-RACCNO       PIC X(11).
               10  WK-ACRO-MCUYCD       PIC X(03).