*----------  COPYBOOK FOR CALLING TRFBLKB - 15/06/04  ----------*

       01  WK-BLKB.
           05  WK-BLKB-INPUT.
               10  WK-BLKB-BKID        PIC X(11).
           05  WK-BLKB-OUTPUT.
               10  WK-BLKB-ERROR-FOUND PIC X(01).
               10  WK-BLKB-INDIC       PIC X(01).