       01  WK-EXCB.
           05  WK-EXCB-INPUT.
           10  WK-EXCB-BKID        PIC X(11).
           05  WK-EXCB-OUTPUT.
           10  WK-EXCB-ERROR-FOUND PIC X(01).
           10  WK-EXCB-INDIC       PIC X(01).
