      *----------  COPYBOOK FOR FIL3900 - 17/08/89  ----------  *
       01  WK-C-FIL3900-RECORD.
           05  WK-C-RDS               PIC X(01)  VALUE "N".
           05  WK-C-3090              PIC X(4096).
