      *           MAS NOSTRO A/C NO
           06 TFSBNKET-SETUPDTE     PIC S9(8).
      *           SET UP DATE
           06 TFSBNKET-LSTUPDTE     PIC S9(8).
      *           LAST UPDATE DATE