       01  WK-OBCD.
           05  WK-OBCD-INPUT.
               10  WK-OBCD-BKCD        PIC X(04).
           05  WK-OBCD-OUTPUT.
               10  WK-OBCD-ERROR-FOUND PIC X(01).
               10  WK-OBCD-INDIC       PIC X(01).