      * I-O FORMAT:TFS202VR FROM FILE TFS202V
      *
           05 TFS202VR REDEFINES TFS202V-RECORD.
           06 TFS202V-MT202VBK PIC X(11).
      *        BANK ID OF MT202 COVER BANK
           06 TFS202V-BNKFNAME PIC X(35).
      *        BANK DESCRIPTION
           06 TFS202V-SETUPDTE PIC S9(8).
      *        SET UP DATE
           06 TFS202V-LSTUPDTE PIC S9(8).
      *        LAST UPDATE DATE
