*----------  COPYBOOK FOR CALLING TRFVTD2 - 07/06/2004  ----------*
       01  WK-VTD2.
           05 WK-VTD2-INPUT.
               10 WK-VTD2-PARALNO    PIC 9(08).
               10 WK-VTD2-SEQNUM     PIC 9(02).
           05 WK-VTD2-OUTPUT.
               10 WK-VTD2-NO-ERROR   PIC X(01).
               10 WK-VTD2-DATAD2     PIC X(20).